app/controllers/authentications_controller.rb

  def register
    puts user_params
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "ed@ed.com"], ["password_digest", "$2a$10$1osX8Y27KowWZStE9hf3h.imeUMNFuwGPVVJh447FwPBgNKBVrxNC"], ["created_at", 2017-02-20 19:02:53 UTC], ["updated_at", 2017-02-20 19:02:53 UTC]]