app/controllers/bs_yearly_results_controller.rb

  def show
    render json: Company.first.filings.last.bs_yearly_results.first
---
SELECT  "bs_yearly_results".* FROM "bs_yearly_results" WHERE "bs_yearly_results"."filing_id" = $1 ORDER BY "bs_yearly_results"."id" ASC LIMIT $2  [["filing_id", 6], ["LIMIT", 1]]
SELECT  "companies".* FROM "companies" ORDER BY "companies"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "filings".* FROM "filings" WHERE "filings"."company_id" = $1 ORDER BY "filings"."id" DESC LIMIT $2  [["company_id", 1], ["LIMIT", 1]]