app/controllers/companies_controller.rb

  def index
    companies = Company.all
---
SELECT "companies".* FROM "companies"

  def model_show
    ticker = params['ticker']
    company = Company.find_by ticker: ticker
---
SELECT  "companies".* FROM "companies" WHERE "companies"."ticker" = $1 LIMIT $2  [["ticker", "AAPL"], ["LIMIT", 1]]